import {
  AboutUs,
  Button,
  ContactUs,
  Employee,
  Industry,
  Instructions,
  NavBar,
  WhyChooseUs,
} from '@enums/i18nConstants';

export const ru = {
  [NavBar.AllProducts]: 'Все товары',
  [NavBar.SellToUs]: 'Продайте нам',
  [NavBar.AboutUs]: 'О нас',
  [NavBar.ContactUs]: 'Свяжитесь с нами',

  [Button.MyPriceQuote]: 'Моё ценовое предложение',
  [Button.AllMachines]: 'Все машины',
  [Button.NewArrivals]: 'Новые поступления',
  [Button.WatchOnYoutube]: 'Смотреть на YouTube',
  [Button.ShopNow]: 'Купить сейчас',
  [Button.ShowMore]: 'Показать больше',
  [Button.ViewDetails]: 'Посмотреть детали',
  [Button.AddedToQuote]: 'Добавлено в запрос',
  [Button.RequestPricing]: 'Запросить цену',

  [Industry.MeatTitle]: 'Мясо',
  [Industry.MeatDesc]: '',
  [Industry.FishTitle]: 'Рыба',
  [Industry.FishDesc]: '',
  [Industry.BakeryTitle]: 'Выпечка',
  [Industry.BakeryDesc]: '',
  [Industry.DairyTitle]: 'Молочные продукты',
  [Industry.DairyDesc]: '',
  [Industry.VegetablesTitle]: 'Фрукты / Овощи',
  [Industry.VegetablesDesc]: '',
  [Industry.MedicinesTitle]: 'Лекарства',
  [Industry.MedicinesDesc]: '',

  [Instructions.Step1Title]: 'Предоставьте нам информацию',
  [Instructions.Step1Desc]:
    'Вы заполняете форму, предоставляете свою контактную информацию, полное описание оборудования, которое хотите продать, указывая цену, включая видео/фото.',
  [Instructions.Step2Title]: 'Быстрая оценка',
  [Instructions.Step2Desc]:
    'Наши опытные специалисты оценят ваше оборудование и свяжутся с вами по поводу нашего решения.',
  [Instructions.Step3Title]: 'Сделка!',
  [Instructions.Step3Desc]:
    'Мы договариваемся с вами о способах оплаты, условиях и доставке. Мы обычно берем на себя доставку, так что вам не о чем беспокоиться.',

  [AboutUs.WhoWeAreTitle]: 'Кто мы',
  [AboutUs.WhoWeAreDesc]:
    'С более чем двадцатилетним опытом работы в отрасли, компания Meat Machines стала лидером на рынке. Наша команда состоит из более чем 10 высококвалифицированных специалистов, которые увлечены своей работой. Мы работаем с четырьмя большими складами на юге Швеции, где храним впечатляющий запас из почти 2 000 единиц оборудования.',
  [AboutUs.WhatWeDoTitle]: 'Что мы делаем',
  [AboutUs.WhatWeDoDesc]:
    'Мы специализируемся на покупке и продаже бывшего в употреблении оборудования для пищевой промышленности и упаковки. Наш обширный инвентарь гарантирует, что мы можем удовлетворить разнообразные потребности наших клиентов, независимо от их конкретных требований. Каждая единица оборудования поступает от лучших поставщиков и поддерживается в отличном состоянии благодаря нашим прочным связям с различными скандинавскими компаниями пищевой промышленности.',
  [AboutUs.OurCommitmentTitle]: 'Наше обязательство к качеству',
  [AboutUs.OurCommitmentDesc]:
    'Качество лежит в основе всего, что мы делаем. Ваше будущее оборудование очень повезло, что оно попало в руки наших квалифицированных и преданных специалистов. Наша команда опытных электриков и механиков тщательно осматривает и обслуживает каждую единицу оборудования, которое проходит через наши двери. С тысячами единиц техники, прошедших через их умелые руки, наша команда гарантирует, что вы получите надежное, эффективное и готовое к работе оборудование.',
  [AboutUs.OurCustomersTitle]: 'Наши клиенты',
  [AboutUs.OurCustomersDesc]:
    'Наше стремление к совершенству принесло нам тысячи довольных клиентов на всех континентах. Мы гордимся тем, что можем удовлетворить и превзойти ожидания наших клиентов, предоставляя им лучшее оборудование и сервис на рынке.',
  [AboutUs.ContinuousTitle]: 'Постоянное улучшение',
  [AboutUs.ContinuousDesc]:
    'В компании Meat Machines мы убеждены, что всегда есть место для улучшений. Несмотря на наш обширный опыт, мы продолжаем учиться и развиваться, чтобы лучше обслуживать вас. Мы постоянно совершенствуем наши методы поиска, улучшаем наши протоколы обслуживания и оптимизируем процессы доставки, чтобы обеспечить более быстрые ответы и конкурентоспособные цены. Наша цель — каждый раз предоставлять вам лучшее оборудование и лучший сервис.',

  [WhyChooseUs.YearsDesc]: 'лет опыта',
  [WhyChooseUs.TheBestTitle]: 'Лучшее',
  [WhyChooseUs.TheBestDesc]: 'Оборудование на рынке',
  [WhyChooseUs.ThousandsTitle]: 'Тысячи',
  [WhyChooseUs.ThousandsDesc]: 'довольных клиентов по всему миру',

  [Employee.Hampus]: 'Хампус Вальгрен',
  [Employee.HampusDesc]: 'ПРОДАЖИ Швеция и зарубеж',
  [Employee.Hakan]: 'Хокан Вальгрен',
  [Employee.HakanDesc]: 'ГЕНЕРАЛЬНЫЙ ДИРЕКТОР / ЗАКУПКИ',
  [Employee.Erika]: 'Эрика Вальгрен',
  [Employee.ErikaDesc]: 'АДМИНИСТРАЦИЯ. УПРАВЛЕНИЕ НЕДВИЖИМОСТЬЮ',
  [Employee.Eva]: 'Эва Андерссон',
  [Employee.EvaDesc]: 'ФИНАНСЫ',
  [Employee.Catharine]: 'Катарина Вальгрен',
  [Employee.CatharineDesc]: 'ФИНАНСЫ',
  [Employee.Artem]: 'Артем Бортник',
  [Employee.ArtemDesc]: 'ПОМОЩНИК ПРОДАЖ',

  [ContactUs.Info1]:
    'Если у вас есть вопросы по поводу наших <1>товаров или доставки</1>, пожалуйста, свяжитесь с <1>Хампусом Вальгреном</1> (или его помощником <1>Артемом Бортником</1>)',
  [ContactUs.Info2]:
    'Если у вас есть вопросы по поводу <1>оплаты</1>, пожалуйста, свяжитесь с <1>Эвой Андерссон</1>',
  [ContactUs.ViewOnMap]: 'Посмотреть на карте',
  [ContactUs.WorkingHours]: 'Часы работы',
  [ContactUs.MonFri]: 'Пн-Пт',
};
