import {
  AboutUs,
  Button,
  ContactUs,
  Employee,
  Industry,
  Instructions,
  NavBar,
  WhyChooseUs,
} from '@enums/i18nConstants';

export const uk = {
  [NavBar.AllProducts]: 'Всі продукти',
  [NavBar.SellToUs]: 'Продайте нам',
  [NavBar.AboutUs]: 'Про нас',
  [NavBar.ContactUs]: "Зв'яжіться з нами",

  [Button.MyPriceQuote]: 'Моя цінова пропозиція',
  [Button.AllMachines]: 'Всі машини',
  [Button.NewArrivals]: 'Нові надходження',
  [Button.WatchOnYoutube]: 'Дивитися на YouTube',
  [Button.ShopNow]: 'Купити зараз',
  [Button.ShowMore]: 'Показати більше',
  [Button.ViewDetails]: 'Деталі',
  [Button.AddedToQuote]: 'Додано до пропозиції',
  [Button.RequestPricing]: 'Запит ціни',

  [Industry.MeatTitle]: "М'ясо",
  [Industry.MeatDesc]: '',
  [Industry.FishTitle]: 'Риба',
  [Industry.FishDesc]: '',
  [Industry.BakeryTitle]: 'Випічка',
  [Industry.BakeryDesc]: '',
  [Industry.DairyTitle]: 'Молочні продукти',
  [Industry.DairyDesc]: '',
  [Industry.VegetablesTitle]: 'Фрукти / Овочі',
  [Industry.VegetablesDesc]: '',
  [Industry.MedicinesTitle]: 'Ліки',
  [Industry.MedicinesDesc]: '',

  [Instructions.Step1Title]: 'Надайте нам інформацію',
  [Instructions.Step1Desc]:
    'Ви заповнюєте форму, надаючи свої контактні дані, повний опис обладнання, яке ви хочете продати, вказуючи ціну, включаючи відео/фото.',
  [Instructions.Step2Title]: 'Швидка оцінка',
  [Instructions.Step2Desc]:
    "Наші досвідчені фахівці оцінять ваше обладнання та зв'яжуться з вами щодо нашого рішення.",
  [Instructions.Step3Title]: 'Угода!',
  [Instructions.Step3Desc]:
    'Ми домовляємося з вами про способи оплати, умови та доставку. Ми зазвичай займаємося доставкою, тому вам не потрібно про це турбуватися.',

  [AboutUs.WhoWeAreTitle]: 'Хто ми',
  [AboutUs.WhoWeAreDesc]:
    'Маючи понад два десятиліття досвіду в галузі, Meat Machines виросла і стала лідером ринку. Наша команда складається з понад 10 висококваліфікованих фахівців, які захоплені своєю справою. Ми працюємо з чотирьох великих складів, розташованих на півдні Швеції, де зберігається вражаючий інвентар майже 2000 одиниць техніки.',
  [AboutUs.WhatWeDoTitle]: 'Що ми робимо',
  [AboutUs.WhatWeDoDesc]:
    "Ми спеціалізуємося на купівлі та продажу вживаного обладнання для харчової переробки та пакування. Наш величезний інвентар забезпечує задоволення різноманітних потреб наших клієнтів, незалежно від їхніх вимог. Кожен елемент обладнання походить від найкращих постачальників і підтримується в чудовому стані завдяки нашим міцним зв'язкам із різними північними виробничими компаніями.",
  [AboutUs.OurCommitmentTitle]: 'Наше зобов’язання щодо якості',
  [AboutUs.OurCommitmentDesc]:
    'Якість є основою всього, що ми робимо. Ваша майбутня машина має велике щастя, що потрапила в руки наших кваліфікованих і відданих фахівців. Наша команда досвідчених електриків і механіків ретельно оглядає та підтримує кожну одиницю обладнання, яке проходить через наші двері. Завдяки тисячам одиниць техніки, що пройшли через їхні вмілі руки, наша команда забезпечує, що ви отримаєте надійну, ефективну та готову до роботи техніку.',
  [AboutUs.OurCustomersTitle]: 'Наші клієнти',
  [AboutUs.OurCustomersDesc]:
    'Наша прихильність до досконалості принесла нам тисячі задоволених клієнтів на всіх континентах. Ми пишаємося тим, що можемо відповідати та перевершувати очікування наших клієнтів, надаючи їм найкраще обладнання та сервіс на ринку.',
  [AboutUs.ContinuousTitle]: 'Безперервне вдосконалення',
  [AboutUs.ContinuousDesc]:
    'У Meat Machines ми віримо, що завжди є можливість для покращення. Незважаючи на наш великий досвід, ми постійно вчимося та розвиваємося, щоб краще вас обслуговувати. Ми постійно вдосконалюємо наші методи пошуку, покращуємо наші протоколи технічного обслуговування та оптимізуємо наші процеси доставки, щоб забезпечити швидші відповіді та більш конкурентоспроможні ціни. Наша мета — забезпечити вам найкраще обладнання та найкращий сервіс кожного разу.',

  [WhyChooseUs.YearsDesc]: 'років досвіду',
  [WhyChooseUs.TheBestTitle]: 'Найкраще',
  [WhyChooseUs.TheBestDesc]: 'Обладнання на ринку',
  [WhyChooseUs.ThousandsTitle]: 'Тисячі',
  [WhyChooseUs.ThousandsDesc]: 'задоволених клієнтів по всьому світу',

  [Employee.Hampus]: 'Хампус Вальгрен',
  [Employee.HampusDesc]: 'ПРОДАЖІ Швеція та за кордоном',
  [Employee.Hakan]: 'Хокан Вальгрен',
  [Employee.HakanDesc]: 'ГЕНЕРАЛЬНИЙ ДИРЕКТОР / ЗАКУПІВЛІ',
  [Employee.Erika]: 'Еріка Вальгрен',
  [Employee.ErikaDesc]: 'АДМІН. УПРАВЛІННЯ НЕРУХОМІСТЮ',
  [Employee.Eva]: 'Ева Андерссон',
  [Employee.EvaDesc]: 'ФІНАНСИ',
  [Employee.Catharine]: 'Катаріна Вальгрен',
  [Employee.CatharineDesc]: 'ФІНАНСИ',
  [Employee.Artem]: 'Артем Бортнік',
  [Employee.ArtemDesc]: 'АСИСТЕНТ ПРОДАЖ',

  [ContactUs.Info1]:
    'Якщо у вас є питання щодо наших <1>продуктів або доставки</1>, будь ласка, зв’яжіться з <1>Хампусом Вальгреном</1> (або його помічником <1>Артемом Бортником</1>)',
  [ContactUs.Info2]:
    'Якщо у вас є питання щодо <1>оплати</1>, будь ласка, зв’яжіться з <1>Евою Андерссон</1>',
  [ContactUs.ViewOnMap]: 'Переглянути на карті',
  [ContactUs.WorkingHours]: 'Робочі години',
  [ContactUs.MonFri]: 'Пн-Пт',
};
